gdb ./a.out
GNU gdb (GDB) Red Hat Enterprise Linux (7.2-90.el6)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /home/eaizhao/code_demo/c/gdb_malloc/a.out...(no debugging symbols found)...done.
(gdb) b main
Breakpoint 1 at 0x400525
(gdb) c
The program is not being run.
(gdb) r
Starting program: /home/eaizhao/code_demo/c/gdb_malloc/a.out

Breakpoint 1, 0x0000000000400525 in main ()
(gdb) call malloc(4)
$1 = (void *) 0x601010
(gdb) call memset(0x601010, 0, 4)
$2 = 6295568
(gdb) call func1(20, 0x601010)
$3 = 6295568
(gdb) p *0x601010
$4 = 400
(gdb) call func1(30, 0x601010)
$5 = 6295568
(gdb) p *0x601010
$6 = 900
(gdb) quit
A debugging session is active.

	Inferior 1 [process 403500] will be killed.

Quit anyway? (y or n) y
